# Pandas Tutorial

In [1]:
import pandas as pd

## Creating DataFrame with Demo Data

We can specify the column name by passing the names columns as a list to the `columns` argument. Similarly we can pass the index with the `index` arugument.

In [2]:
# df = pd.DataFrame([[1,2,3], [4,5,6],[7,8,9]])
df = pd.DataFrame([[1,2,3], [4,5,6],[7,8,9]], columns = ['A', 'B', 'C']) # Adding the column names
# df = pd.DataFrame([[1,2,3], [4,5,6],[7,8,9]], columns = ['A', 'B', 'C'], index=['x', 'y','z']) # Adding the index
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

## Dataframe Basic

### df.head()
- It will show us the top 5 rows of the dataframe by default
- We can specify the amount of rows we want to see `df.head(3)`, `df.head(2)`

In [3]:
df.head(2)

   A  B  C
0  1  2  3
1  4  5  6

### df.tail()
- It will show us the bottom 5 rows of the dataframe by default
- We can specify the amount of rows we want to see `df.tail(3)`, `df.tail(2)`

In [4]:
df.tail(2)

   A  B  C
1  4  5  6
2  7  8  9

### df.columns
It will show us the name of the columns/headers. Remember this is an attribute not a method.

In [5]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

### df[column].sum()
> IT sum up the numbers in that column. **Only applicable for numerical data.**

In [109]:
df['A'].sum()

np.int64(12)

### df['column'].mean()
> IT calculates the mean of that column. **Only applicable for numerical data.**

In [110]:
df['B'].mean()

np.float64(5.0)

### df.['column'].min()
> It calculates the minimum number or category in a column. **Applicable for both categorical and numerical data**

In [111]:
df['C'].min()

np.int64(3)

### df.['column'].max()
> It calculates the maximum number or category in a column. **Applicable for both categorical and numerical data**

In [112]:
df['C'].max()

np.int64(9)

### df.count()

> When we want to count the number of non-missing values in each column and row of a dataframe. **Works for both Series and Dataframe**

In [121]:
print(df.count())
print(df['A'].count())

A    3
B    3
C    3
dtype: int64
3

### df['column'].value_counts()
> When we want to count how many times each unique value appears in a specific column or Series.
<br>

Works only on a single Series (a colum or a subset)

In [122]:
df['A'].value_counts()

A
1    1
4    1
7    1
Name: count, dtype: int64

### df.index
It will give us the overview of all the records.

In [6]:
print(df.index)

# To see the list of indexes
print(df.index.to_list())

RangeIndex(start=0, stop=3, step=1)
[0, 1, 2]

### df.info()
> Gives us an overview of the dataframe.
1. Index: gives us the number of records are there and the range of index.
2. Data columns: The number of columns
3. Columnwise null value information as well as the Data type
4. An overall infromation about the data types in this dataframe
5. The size of the dataframe

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

### df.describe()
> Gives us some meanigful information about our dataframe based on each column.
1. **count**: Number of records under each column.
2. **mean**: The mean of each column.
3. **std**: The standard deviation of each column.
4. **min**: The minimum value in the column.
5. **25%** (1st quartile): The value below which 25% of the data falls.
6. **50%** (Median): The middle value that splits the data into two halves.
7. **75%** (3rd quartile): The value below which 75% of the data falls.
8. **max**: The maximum value in the column.

In [8]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

### df.nunique()
> To see the number of unique values in each column

In [9]:
df.nunique()

A    3
B    3
C    3
dtype: int64

### df['col'].unique()
> This will give us the list of unique values in a column

In [10]:
df['A'].unique()

array([1, 4, 7])

### df.shape
> Tells us the number of rows and columns in the dataframe.

In [11]:
df.shape

(3, 3)

### df.size
> Returns the total number of datapoints in the data. It's actually the multiplication of rows and columns

In [12]:
df.size

9

### df.sample()
> It will return a random row. We can specify how many we want to see by `df.sample(3)`.

In [13]:
df.sample(3)

   A  B  C
1  4  5  6
2  7  8  9
0  1  2  3

## Creating DataFrame from online Data

In [14]:
coffee = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv')

coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

## Accessing the Data from a DataFrame

### df.loc[#rows, #columns]
> We can access the value of specific row(s) and col(s). We will use the column names whereas in the `iloc()`, we will use the column index.

In [15]:
# Accessing the specific row by index
coffee.loc[3]

Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object

In [16]:
# Accessing multiple rows
coffee.loc[[1,6,8]]

        Day Coffee Type  Units Sold
1    Monday       Latte          15
6  Thursday    Espresso          40
8    Friday    Espresso          45

In [17]:
# Perform slicing
coffee.loc[5:8]

         Day Coffee Type  Units Sold
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45

In [18]:
# Specific column
coffee.loc[5:8, ['Day']]

         Day
5  Wednesday
6   Thursday
7   Thursday
8     Friday

In [19]:
# Specific columns
coffee.loc[5:8, ['Day', 'Units Sold']]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45

In [20]:
# For all the rows and specific columns
coffee.loc[:, ['Day', 'Units Sold']]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

### df.iloc[#rows, #colum_index]
> This will perform the same thing, Instead of column name we need to access via the column_index <br>
Remember when slicing, `loc` fucntion includes the upper limit, however `iloc` function does not.

In [21]:
# Accessing the specific row by index
coffee.iloc[3]

Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object

In [22]:
# Accessing multiple rows
coffee.iloc[[1,6,8]]

        Day Coffee Type  Units Sold
1    Monday       Latte          15
6  Thursday    Espresso          40
8    Friday    Espresso          45

In [23]:
# Perform slicing
coffee.iloc[5:8]

# Look the upper limit is not inclusive

         Day Coffee Type  Units Sold
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30

In [24]:
# Specific column
coffee.iloc[5:8, [0]] # Instead of the name of the column, we are passing the index

         Day
5  Wednesday
6   Thursday
7   Thursday

In [25]:
# Specific columns
coffee.iloc[5:8, [0,2]]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30

In [26]:
# For all the rows and specific columns
coffee.iloc[:, [0, 2]]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

### Grab specific column
> We can grab all the information of a specific column

In [27]:
coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [28]:
# Another way and my favorite is
print(coffee[['Day']]) # Double square bracket returs a dataframe.
print(coffee['Day']) # Single square bracket returns a series

          Day
0      Monday
1      Monday
2     Tuesday
3     Tuesday
4   Wednesday
5   Wednesday
6    Thursday
7    Thursday
8      Friday
9      Friday
10   Saturday
11   Saturday
12     Sunday
13     Sunday
0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

## Sorting Values in a Dataframe
> We can sort the values of a Dataframe

### df.sort_value('column_name')
> This will sort a column by ascending order

In [29]:
coffee.sort_values('Units Sold')

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
13     Sunday       Latte          35
11   Saturday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

### ascending = False
> Sort in descending order

In [30]:
coffee.sort_values('Units Sold', ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

### Sort Multiple Columns
1. We need to pass the columns in a list
2. In the ascending argument, it will be also a list of 0s and 1s. 0 = False, 1 = True

In [31]:
coffee.sort_values(['Day', 'Units Sold', 'Coffee Type'], ascending=[1,0,1])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
9      Friday       Latte          35
0      Monday    Espresso          25
1      Monday       Latte          15
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35
6    Thursday    Espresso          40
7    Thursday       Latte          30
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25

## Filtering Data

We will look into the bios.csv and learn on this.

In [32]:
bios = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/bios.csv')

bios.head(3)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17

We will filter this csv based on the height_cm column. We will look into how many people in there have height more than 215cm.

In [33]:
# Conditional Formatting
bios.loc[bios['height_cm']>215]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,So Paulo,So Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,Mnchen (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5796,5819,Andy Campbell,1956-07-21,Melbourne,Victoria,AUS,Australia,218.0,93.0,NaN
6223,6250,Lars Hansen,1954-09-27,Kbenhavn (Copenhagen),Hovedstaden,DEN,Canada,216.0,105.0,NaN
6270,6298,Hu Zhangbao,1963-04-05,NaN,NaN,NaN,People's Republic of China,216.0,135.0,NaN
6409,6440,Sergey Kovalenko,1947-08-11,NaN,NaN,NaN,Soviet Union,216.0,111.0,2004-11-18
6420,6451,Jnis Krmi,1930-01-30,Csis,Csu novads,LAT,Soviet Union,218.0,141.0,1994-11-20
6504,6537,Luc Longley,1969-01-19,Melbourne,Victoria,AUS,Australia,220.0,135.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
7074,7111,Paulo da Silva,1963-07-21,So Paulo,So Paulo,BRA,Brazil,217.0,106.0,NaN
7188,7226,Vladimir Tkachenko,1957-09-20,Golovinka,Krasnodar Kray,RUS,Soviet Union,220.0,110.0,NaN
7281,7320,Stojko Vrankovi,1964-01-22,Drni,ibensko-kninska upanija,CRO,Croatia Yugoslavia,217.0,115.0,NaN
7376,7416,Eurelijus ukauskas,1973-08-22,Klaipda,Klaipda,LTU,Lithuania,218.0,115.0,NaN
52608,52983,Aleksey Kazakov,1976-03-18,Naberezhnye Chelny,Respublika Tatarstan,RUS,Russian Federation,217.0,102.0,NaN
82100,82753,Frdric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
107408,108533,Peter John Ramos,1985-05-23,Fajardo,Puerto Rico,PUR,Puerto Rico,219.0,113.0,NaN
112312,113568,Stanko Bara,1986-08-13,Mostar,Hercegovako-neretvanski kanton,BIH,Croatia,217.0,110.0,NaN
112332,113588,Andreas Glyniadakis,1981-08-26,Chania,Kriti,GRE,Greece,216.0,115.0,NaN
112337,113593,Hamed Haddadi,1985-05-19,Ahvaz,Khuzestan,IRI,Islamic Republic of Iran,218.0,110.0,NaN
118663,120400,Timofey Mozgov,1986-07-16,NaN,NaN,NaN,Russian Federation,216.0,113.0,NaN
118676,120415,Dmitry Musersky,1988-10-29,Makivka,Donetsk,UKR,Russian Federation,219.0,104.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN
121694,123709,Salah Mejri,1986-06-15,Jendouba,Jendouba,TUN,Tunisia,216.0,110.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
130460,133147,Li Muhao,1992-06-02,Guiyang,Guizhou,CHN,People's Republic of China,218.0,115.0,NaN
130461,133148,Zhou Qi,1996-01-16,Xinxiang,Henan,CHN,People's Republic of China,217.0,95.0,NaN
138671,142084,Ondej Balvn,1992-09-20,st nad Labem,steck kraj,CZE,Czechia,216.0,107.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [34]:
# Conditional Formatting
bios.loc[bios['height_cm']>215, ['name', 'height_cm']]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jnis Krmi      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vrankovi      217.0
7376      Eurelijus ukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frdric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Bara      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondej Balvn      216.0
139365         Moustapha Fall      218.0

In [35]:
# Use multiple condition:
# We have to keep each condition inside parenthesis.

bios.loc[(bios['height_cm'] > 215) & (bios['born_country'] == 'USA'), ['name', 'height_cm']]

                    name  height_cm
5781      Tommy Burleson      223.0
6722    Shaquille O'Neal      216.0
6937      David Robinson      216.0
123850    Tyson Chandler      216.0

## Filtering Data with String operations

It will work with the string in our dataframe.

### str.contains()
> Check whether a substring is in a string

In [36]:
bios.loc[bios['name'].str.contains('keith', case=False)] # case = False to make it not to be case sensitive

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [37]:
# What if we want to filter with keith or patrick in their name.
bios.loc[bios['name'].str.contains('keith|patrick', case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
2115,2125,Patrick Jopp,1962-01-08,NaN,NaN,NaN,Switzerland,176.0,67.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143975,147633,Patrick Chinyemba,2001-01-03,NaN,NaN,NaN,Zambia,NaN,NaN,NaN
144172,147850,Patrick Jakob,1996-10-17,Sankt Johann in Tirol,Tirol,AUT,Austria,NaN,NaN,NaN
144547,148239,Patrick Galbraith,1986-03-11,Haderslev,Syddanmark,DEN,Denmark,NaN,NaN,NaN
144565,148257,Patrick Russell,1993-01-04,Gentofte,Hovedstaden,DEN,Denmark,186.0,93.0,NaN
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12

### str.split('')
> Will split the string based on the '' character. <br>


Lets say we want to get the first name of all the athlets.

In [38]:
bios['name'].str.split(' ').str[0]

0         Jean-Franois
1                Arnaud
2                  Jean
3               Jacques
4                Albert
              ...
145495           Polina
145496         Valeriya
145497           Yuliya
145498            Andr
145499             Bill
Name: name, Length: 145500, dtype: object

### isin() and str.startswidth()
> `isin()` check whether something is in a given list or not?<br>
> `str.startswidth()` check whether the String begins with the given substring

In [39]:
bios.loc[(bios['born_country'].isin(['USA', 'FRA', 'GBR'])) & (bios['name'].str.contains('Keith'))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
14577,14674,Keith Harrison,1933-03-28,Birmingham,England,GBR,Great Britain,NaN,NaN,NaN
16166,16281,Keith Reynolds,1963-12-25,Solihull,England,GBR,Great Britain,173.0,68.0,NaN
18734,18862,Keith Sinclair,1945-06-26,Sunderland,England,GBR,Great Britain,190.0,79.0,NaN
29897,30123,Keith Langley,1961-06-03,Aldershot,England,GBR,Great Britain,173.0,70.0,NaN
34011,34275,Keith Remfry,1947-11-17,Ealing,England,GBR,Great Britain,193.0,114.0,2015-09-16
46885,47234,Keith Collin,1937-01-18,Marylebone,England,GBR,Great Britain,168.0,63.0,1991-03-06
50929,51288,Keith Carter,1924-08-30,Akron,Ohio,USA,United States,NaN,NaN,2013-05-03
51185,51544,Keith Russell,1948-01-15,Mesa,Arizona,USA,United States,188.0,73.0,NaN
52913,53288,Keith Erickson,1944-04-19,San Francisco,California,USA,United States,196.0,86.0,NaN
55317,55712,Keith Boxell,1958-05-06,Clapham,England,GBR,Great Britain,170.0,87.0,NaN
57818,58226,Keith Peache,1947-08-10,Lewisham,England,GBR,Great Britain,180.0,98.0,NaN
61748,62202,Keith Grogono,1912-11-04,Stratford,England,GBR,Great Britain,NaN,NaN,1999-03-22
62620,63086,Keith Musto,1936-01-12,Rochford,England,GBR,Great Britain,174.0,72.0,NaN
62678,63144,Keith Notary,1960-01-22,Merritt Island,Florida,USA,United States,170.0,66.0,NaN
68324,68841,Keith Angus,1943-04-05,Sheffield,England,GBR,Great Britain,170.0,59.0,NaN
68472,68989,Keith Cullen,1972-06-13,Ilford,England,GBR,Great Britain,177.0,61.0,NaN
68997,69514,Keith Stock,1957-03-18,Woolwich,England,GBR,Great Britain,176.0,73.0,NaN
77550,78141,Keith Brantly,1962-05-23,Scott Air Force Base,Illinois,USA,United States,180.0,64.0,NaN
84097,84766,Keith Christiansen,1944-07-14,International Falls,Minnesota,USA,United States,165.0,69.0,2018-11-05
94646,95413,Keith Meyer,1938-06-20,Geneva,Illinois,USA,United States,NaN,NaN,2010-07-25
95267,96037,Keith Oliver,1947-10-27,Liverpool,England,GBR,Great Britain,172.0,68.0,NaN
96452,97229,Keith Schellenberg,1929-03-13,Middlesbrough,England,GBR,Great Britain,NaN,NaN,2019-10-28
97499,98286,Keith Tkachuk,1972-03-28,Melrose,Massachusetts,USA,United States,188.0,102.0,NaN
98068,98860,Keith Wegeman,1929-08-28,Denver,Colorado,USA,United States,NaN,NaN,1974-08-22
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN

## Adding and Removig a column

### Adding a column

In [40]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

We can add columns very easily.

In [41]:
coffee['Price'] = 3.99
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso          25   3.99
1      Monday       Latte          15   3.99
2     Tuesday    Espresso          30   3.99
3     Tuesday       Latte          20   3.99
4   Wednesday    Espresso          35   3.99
5   Wednesday       Latte          25   3.99
6    Thursday    Espresso          40   3.99
7    Thursday       Latte          30   3.99
8      Friday    Espresso          45   3.99
9      Friday       Latte          35   3.99
10   Saturday    Espresso          45   3.99
11   Saturday       Latte          35   3.99
12     Sunday    Espresso          45   3.99
13     Sunday       Latte          35   3.99

However, The price of Latte should be more than the price of Espresso. We need to set price accordingly. <br>

With the help of numpy, we can achieve this.

In [42]:
import numpy as np

coffee['New Price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)

# if the condition coffee['Coffee Type'] == 'Espresso'
# Put the price 3.99
# For all the other cases, the price will be 5.99

coffee

          Day Coffee Type  Units Sold  Price  New Price
0      Monday    Espresso          25   3.99       3.99
1      Monday       Latte          15   3.99       5.99
2     Tuesday    Espresso          30   3.99       3.99
3     Tuesday       Latte          20   3.99       5.99
4   Wednesday    Espresso          35   3.99       3.99
5   Wednesday       Latte          25   3.99       5.99
6    Thursday    Espresso          40   3.99       3.99
7    Thursday       Latte          30   3.99       5.99
8      Friday    Espresso          45   3.99       3.99
9      Friday       Latte          35   3.99       5.99
10   Saturday    Espresso          45   3.99       3.99
11   Saturday       Latte          35   3.99       5.99
12     Sunday    Espresso          45   3.99       3.99
13     Sunday       Latte          35   3.99       5.99

### Removing/Droping a column
without `inplace = True`, The change will not be affected

In [43]:
coffee.drop(columns=['Price'])

          Day Coffee Type  Units Sold  New Price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       5.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       5.99

In [44]:
coffee

          Day Coffee Type  Units Sold  Price  New Price
0      Monday    Espresso          25   3.99       3.99
1      Monday       Latte          15   3.99       5.99
2     Tuesday    Espresso          30   3.99       3.99
3     Tuesday       Latte          20   3.99       5.99
4   Wednesday    Espresso          35   3.99       3.99
5   Wednesday       Latte          25   3.99       5.99
6    Thursday    Espresso          40   3.99       3.99
7    Thursday       Latte          30   3.99       5.99
8      Friday    Espresso          45   3.99       3.99
9      Friday       Latte          35   3.99       5.99
10   Saturday    Espresso          45   3.99       3.99
11   Saturday       Latte          35   3.99       5.99
12     Sunday    Espresso          45   3.99       3.99
13     Sunday       Latte          35   3.99       5.99

The price is still there.

In [45]:
coffee.drop(columns=['Price'], inplace=True)
coffee

          Day Coffee Type  Units Sold  New Price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       5.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       5.99

### df.rename(columns = {'old_name' : 'new_name'})

See the New Price column. We want to change the column head to Price. We can achieve this by the `rename()` function. It take columns argument which is a dictionary. The key will be the Old_name and the value will be the new_name. Also you need to put inplace = True.

In [46]:
coffee.rename(columns={'New Price' : 'Price'}, inplace=True)
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso          25   3.99
1      Monday       Latte          15   5.99
2     Tuesday    Espresso          30   3.99
3     Tuesday       Latte          20   5.99
4   Wednesday    Espresso          35   3.99
5   Wednesday       Latte          25   5.99
6    Thursday    Espresso          40   3.99
7    Thursday       Latte          30   5.99
8      Friday    Espresso          45   3.99
9      Friday       Latte          35   5.99
10   Saturday    Espresso          45   3.99
11   Saturday       Latte          35   5.99
12     Sunday    Espresso          45   3.99
13     Sunday       Latte          35   5.99

In [47]:
# Adding a new column named 'revenue'

coffee['revenue'] = coffee['Units Sold'] * coffee['Price']
coffee

          Day Coffee Type  Units Sold  Price  revenue
0      Monday    Espresso          25   3.99    99.75
1      Monday       Latte          15   5.99    89.85
2     Tuesday    Espresso          30   3.99   119.70
3     Tuesday       Latte          20   5.99   119.80
4   Wednesday    Espresso          35   3.99   139.65
5   Wednesday       Latte          25   5.99   149.75
6    Thursday    Espresso          40   3.99   159.60
7    Thursday       Latte          30   5.99   179.70
8      Friday    Espresso          45   3.99   179.55
9      Friday       Latte          35   5.99   209.65
10   Saturday    Espresso          45   3.99   179.55
11   Saturday       Latte          35   5.99   209.65
12     Sunday    Espresso          45   3.99   179.55
13     Sunday       Latte          35   5.99   209.65

## Coping a Dataframe

If we write **`coffee_new = coffee`**, the coffee_new will point to the coffee. Any change made to the coffee_new will change coffee. This is because of memory optimization. So in order to make the coffee_new a separate dataframe with the copied value of coffee, we can use the **`copy()`** function.

In [48]:
coffee_new = coffee.copy()

## DateTime Object

Lets look into the bios dataframe

In [49]:
bios.head(3)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17

We want to see the first name of the athlets. We can get that from string operation as we have seen earlier with the `str.split(' ')`. <br>
Before bringing any parmanent change, we should copy the dataframe.

In [50]:
bios_new = bios.copy()

In [51]:
bios_new['first_name'] = bios['name'].str.split(' ').str[0]

bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert
...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill

We also want a separate column which contains only the born year. <br><br>
First look into the bios_new dataframe

In [52]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 12.2+ MB

### pd.to_datetime()

As you can see the born_date data type is object. We need to convert this to DateTime.

In [53]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17
...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15

This looks exactly as the born_date column. However if we look into the info, we will notice the change.

In [54]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  born_datetime  143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(8)
memory usage: 13.3+ MB

### Datetime error argument

Somethimes we may encounter errors because of not properly formatting the date. We can use `errors = 'coerce'`

In [55]:
# bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'], errors = 'coerce')

### Datetime format argument

We can also specify the format. In this case `format = "%Y-%m-%d"`.

In [56]:
# # bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'], format = '%Y-%m-%d')

### dt.year

As we have seen with the str.split, str.contain, There are dt.year as well as many other attributes and functions for date time

In [57]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year

bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19,1899.0
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0

In [58]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 13 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  born_datetime  143693 non-null  datetime64[ns]
 12  born_year      143693 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(8)
memory usage: 14.4+ MB

## Applying Lambda function

We can apply lambda function to our columns for customization. Lets say we want to categorize the height with short, average and tall category

In [59]:
bios_new['height_category'] = bios_new['height_cm'].apply(lambda x: 'Short' if x<165 else ('Average' if x <185 else 'Tall'))

bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year,height_category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,Tall
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0,Average
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0,Average
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0,Short
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19,1899.0,Average
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0,Tall

## Applying Function

We can use not only the lambda function, but also all kinds of function. Lets say we want to categorize the athlets into three category based on their height and weight.

In [60]:
def categorize_athlete(row): # We will perform operation in each row.
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 and row['weight_kg'] <= 80:
        return 'Middleweight'
    else:
        return 'Heavyweight'
    
bios_new['Category'] = bios_new.apply(categorize_athlete, axis=1) # axis = 1 means row and axis = 0 means column

bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year,height_category,Category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,Tall,Heavyweight
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0,Average,Lightweight
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0,Average,Lightweight
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0,Short,Lightweight
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19,1899.0,Average,Heavyweight
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0,Tall,Heavyweight

## Merging and Concatenating Data

We can builds column by merging and concatenating two dataframe.

In [61]:
nocs = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/noc_regions.csv')

nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

### pd.merge()

> This will marge two dataframe based on the similarities of columns in both dataframes. <br>

Here, the bios dataframe has a column called 'born_country' and the nocs dataframe has a column called 'NOC'. We want to marge the dataframe based on this.

In [62]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

In [63]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,region,notes
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

Here, you can see this successfully merged the both dataframe based on the born_country and the NOC. NOC = National Olympic Committee. Another thing to notice is, both the dataframe has the NOC column. So our `merge()` method added the suffix NOC_x and NOC_y to distinguish between them.

We can also notice that athele_id 4, Albert Canet though born in England however compete for France. Lets say, we want find out how many of these similar cases are there.

In [64]:
bios_new.rename(columns={'region': 'born_country_full'}, inplace=True)
bios_new.head(3)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,born_country_full,notes
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN

In [65]:
bios_new.loc[bios_new['NOC_x'] != bios_new['born_country_full']][['name', 'NOC_x', 'born_country_full']]

                       name    NOC_x born_country_full
4              Albert Canet   France                UK
12                J. Defert   France               NaN
13           tienne Durand   France               NaN
16               Guy Forget   France           Morocco
27       Guy, Baron Lejeune   France               NaN
...                     ...      ...               ...
145491        Matthew Wepke  Jamaica               NaN
145493   Landysh Falyakhova      ROC            Russia
145495    Polina Luchnikova      ROC            Russia
145496  Valeriya Merkusheva      ROC            Russia
145497      Yuliya Smirnova      ROC            Russia

[73210 rows x 3 columns]

### pd.concat([list of dataframes])
> It takes a list of dataframes and append them one after another.

In [66]:
usa = bios.loc[bios['born_country'] == 'USA']
gbr = bios.loc[bios['born_country'] == 'GBR']

In [67]:
new_df = pd.concat([usa, gbr])

In [68]:
new_df

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Anglica Gavaldn,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144811,148512,Benjamin Alexander,1983-05-08,London,England,GBR,Jamaica,NaN,NaN,NaN
144815,148517,Ashley Watson,1993-10-28,Peterborough,England,GBR,Jamaica,NaN,NaN,NaN
145005,148716,Peder Kongshaug,2001-08-13,Wimbledon,England,GBR,Norway,184.0,86.0,NaN
145319,149041,Axel Brown,1992-04-02,Harrogate,England,GBR,Trinidad and Tobago,NaN,NaN,NaN
145388,149111,Jean-Luc Baker,1993-10-07,Burnley,England,GBR,United States,NaN,NaN,NaN

In [69]:
results = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/results.csv')

results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-Franois Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-Franois Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-Franois Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-Franois Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-Franois Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [70]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

See the result dataframe and the bios dataframe both have this athlete_id column. We can merge on this column

In [71]:
combined_df = pd.merge(results, bios, on='athlete_id', how='left')

In [72]:
combined_df.head(3)

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-Franois Blanchy,1,FRA,NaN,17.0,True,NaN,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-Franois Blanchy,1,FRA,Jean Montariol,NaN,False,NaN,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-Franois Blanchy,1,FRA,NaN,32.0,True,NaN,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02

## Handling Null Values

In [73]:
coffee.head()

         Day Coffee Type  Units Sold  Price  revenue
0     Monday    Espresso          25   3.99    99.75
1     Monday       Latte          15   5.99    89.85
2    Tuesday    Espresso          30   3.99   119.70
3    Tuesday       Latte          20   5.99   119.80
4  Wednesday    Espresso          35   3.99   139.65

Lets make some data points under the Unit Sold colum, null with `np.nan`.

In [74]:
coffee.loc[[2,3], ['Units Sold']] = np.nan

In [75]:
coffee

          Day Coffee Type  Units Sold  Price  revenue
0      Monday    Espresso        25.0   3.99    99.75
1      Monday       Latte        15.0   5.99    89.85
2     Tuesday    Espresso         NaN   3.99   119.70
3     Tuesday       Latte         NaN   5.99   119.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   5.99   149.75
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   5.99   179.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   5.99   209.65
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   5.99   209.65
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   5.99   209.65

In [76]:
# Now if we look into the coffee.info() we will see some differences
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   12 non-null     float64
 3   Price        14 non-null     float64
 4   revenue      14 non-null     float64
dtypes: float64(3), object(2)
memory usage: 692.0+ bytes

### isna().sum()
> **`isna()`** Shows the number of null values for every data points (True if it is null)<br>
> **`sum()`** gives the total number of null values for each column

In [77]:
coffee.isna().sum()

Day            0
Coffee Type    0
Units Sold     2
Price          0
revenue        0
dtype: int64

### notna().sum()

> > **`notna()`** Shows the number of null values for every data points (False if it is null)<br>
> **`sum()`** gives the total number of null values for each column

In [78]:
coffee.notna().sum()

Day            14
Coffee Type    14
Units Sold     12
Price          14
revenue        14
dtype: int64

### fillna()

> This will fill the null values with the specified value or functions.

In [79]:
coffee.fillna(10000)

          Day Coffee Type  Units Sold  Price  revenue
0      Monday    Espresso        25.0   3.99    99.75
1      Monday       Latte        15.0   5.99    89.85
2     Tuesday    Espresso     10000.0   3.99   119.70
3     Tuesday       Latte     10000.0   5.99   119.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   5.99   149.75
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   5.99   179.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   5.99   209.65
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   5.99   209.65
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   5.99   209.65

In [80]:
coffee.fillna(coffee['Units Sold'].mean())

          Day Coffee Type  Units Sold  Price  revenue
0      Monday    Espresso   25.000000   3.99    99.75
1      Monday       Latte   15.000000   5.99    89.85
2     Tuesday    Espresso   34.166667   3.99   119.70
3     Tuesday       Latte   34.166667   5.99   119.80
4   Wednesday    Espresso   35.000000   3.99   139.65
5   Wednesday       Latte   25.000000   5.99   149.75
6    Thursday    Espresso   40.000000   3.99   159.60
7    Thursday       Latte   30.000000   5.99   179.70
8      Friday    Espresso   45.000000   3.99   179.55
9      Friday       Latte   35.000000   5.99   209.65
10   Saturday    Espresso   45.000000   3.99   179.55
11   Saturday       Latte   35.000000   5.99   209.65
12     Sunday    Espresso   45.000000   3.99   179.55
13     Sunday       Latte   35.000000   5.99   209.65

### .interpolate()

> It will look at the column and populate the null values based on the data trend of that column.

In [81]:
coffee['Units Sold'].interpolate()

# coffee['Units Sold'] = coffee['Units Sold'].interpolate()

0     25.000000
1     15.000000
2     21.666667
3     28.333333
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

### dropna()

> Drop all the rows that contains null values. <br>

However sometimes we want to only drop the rows for null values in a specific column. Then we should use the `subset = ['column_name']` argument.

In [82]:
coffee.dropna(subset=['Units Sold'])

          Day Coffee Type  Units Sold  Price  revenue
0      Monday    Espresso        25.0   3.99    99.75
1      Monday       Latte        15.0   5.99    89.85
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   5.99   149.75
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   5.99   179.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   5.99   209.65
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   5.99   209.65
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   5.99   209.65

#### Rmember!!! Whenever we try to change the dataframe we need to use the inplace = True

## Aggregating Data
To combine and group data. This is very helpful

### df['column'].value_counts()
>count the occurance of similar things in a table and show the thing and their occurances.

Lets say we want to which city where most athlete borb?

In [83]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Kirovgrad             1
Pereiaslav            1
Podgornyy             1
Kudepsta              1
Furmanov              1
Name: count, Length: 22368, dtype: int64

Another example:

In [85]:
bios.loc[bios['born_country'] == 'USA']['born_region'].value_counts().tail()

born_region
South Dakota     27
West Virginia    24
Delaware         22
North Dakota     16
Wyoming          14
Name: count, dtype: int64

### df.groupby(['column names'])
`groupby()` as a way to organize data into groups before doing something with itlike sorting your socks by color before counting how many you have in each color.
For example:
- If you have a list of people and their favorite fruits, `groupby()` can group everyone by the same favorite fruit.
- Then, you can easily count how many people like each fruit or calculate something (like an average) for each group.
- groupby is very powerful.

In [123]:
coffee.groupby(['Coffee Type']).count()

             Day  Units Sold  Price  revenue
Coffee Type
Espresso       7           7      7        7
Latte          7           7      7        7

In [127]:
coffee.groupby(['Coffee Type'])['Units Sold'].value_counts()

Coffee Type  Units Sold
Espresso     45.000000     3
             21.666667     1
             25.000000     1
             35.000000     1
             40.000000     1
Latte        35.000000     3
             15.000000     1
             25.000000     1
             28.333333     1
             30.000000     1
Name: count, dtype: int64

In [128]:
coffee.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    256.666667
Latte       203.333333
Name: Units Sold, dtype: float64

In [129]:
coffee.groupby(['Coffee Type'])['Units Sold'].min()

Coffee Type
Espresso    21.666667
Latte       15.000000
Name: Units Sold, dtype: float64

In [130]:
coffee.groupby(['Coffee Type'])['Units Sold'].max()

Coffee Type
Espresso    45.0
Latte       35.0
Name: Units Sold, dtype: float64

In [143]:
coffee.groupby(['Day', 'Coffee Type', 'Units Sold']).count()

                                  Price  revenue
Day       Coffee Type Units Sold
Friday    Espresso    45.000000       1        1
          Latte       10.000000       1        1
                      35.000000       1        1
Monday    Espresso    25.000000       1        1
          Latte       15.000000       1        1
Saturday  Espresso    45.000000       1        1
          Latte       35.000000       1        1
Sunday    Espresso    45.000000       1        1
          Latte       35.000000       1        1
Thursday  Espresso    40.000000       1        1
          Latte       30.000000       1        1
Tuesday   Espresso    21.666667       1        1
          Latte       28.333333       1        1
Wednesday Espresso    35.000000       1        1
          Latte       25.000000       1        1

#### agg()

In [ ]:
coffee.groupby(['Coffee Type']).agg({'Units Sold' : 'mean', 'revenue' : 'sum'}).count().reset_index()

        index  0
0  Units Sold  2
1     revenue  2